CFD_OF2/Section3_MeshRefine/MeshB_Refine/MeshB_R4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          220;
        startFace       84810;
    }
    outlet
    {
        type            patch;
        nFaces          220;
        startFace       85030;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          360;
        startFace       85250;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          190;
        startFace       85610;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          190;
        startFace       85800;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          85400;
        startFace       85990;
    }
)

// ************************************************************************* //
